#include "main.h"
 /******************************************************************************
//STM32F103C8
//Ver 1.0
//Author: @DAMON
/*******************************************************************************/

///更新说明
/*************************************************************************
 * 2021.09.24 Damon 更新
 *    1.新增关机前站号保存功能，开机后读取
 *    2.新增站号选择后可直接返回
 *    3.新增工件尺寸误差分级显示 三挡，误差<33% 绿色显示，33%<误差<66%蓝色 误差>66% 橙色显示
 * **********************************************************************/
int main(void)
{
  uint32_t i=0; 
  SYSTEM_Initialize();       //系统初始化

  while (1)
  {
	  Ms_Treat();		//定时器定时处理
	  ScreenProcess();	//屏幕绘制
  }

}
